[
    {
        "visit_date": "2026-02-10",
        "visit_order": 1,
        "customer_name": "Sagolicious",
        "visit_report": "Follow up project healthy chip. Cust di sekitar 1 bulan terakhir ini sedang banyak aktivitas di luar, seperti ada kegiatan di luar kota dan ada acara BPOM, sehingga panel untuk sampel khususnya tes aroma ayam bakar masih belum bisa berjalan lancar. Untuk panel ini akan dilakukan secepatnya supaya bisa memberikan feedback. Cust juga masih menanyakan update terkait SSP gluten free kapan item ini sudah bisa diorder untuk seasoning.",
        "sample_no": []
    },
    {
        "visit_date": "2026-02-11",
        "visit_order": 1,
        "customer_name": "Ivan Kurniawan",
        "visit_report": "Follow up project. Untuk cuanki, perihal PIRT masih belum selesai, untuk kuaci masih mencoba coating dan masih menunggu input metode coating dari islandsun juga dengan sampel base yang sebelumnya sudah diberikan cust. Untuk kuah pempek2, dari client cust minta untuk bumbunya disatukan. Sampel sebelumnya masih terpisah untuk garlic powder, mushroom, dan shrimp. Project ini untuk export sehingga ke depannya quantity lebih menjanjikan dan cust berharap bisa dibuatkan NPD yang sudah ready to use untuk di kuah pempeknya. Sampel target kuah pempeknya saat ini di Pak Ivan sudah tidak ada, dan akan dicoba dimintakan lagi ke clientnya.",
        "sample_no": []
    },
    {
        "visit_date": "2026-02-13",
        "visit_order": 1,
        "customer_name": "Puji Wahyudi",
        "visit_report": "Update penjualan dengan customer. Pak Zulfi yang biasa handle pembelian sebentar lagi akan resign dari jumadi (nama toko cust) dan nanti akan ada pengganti untuk PIC project dan pembelian. Untuk corn masih berjalan lancar, namun untuk sampel2 lainnya masih belum ada keputusan switch dari ownernya, khususnya yang balado. Sebelumnya sudah ada 2 sampel baru yang cocok, tapi ini nanti akan diinfo lagi kapan mulai dipakai.",
        "sample_no": []
    },
    {
        "visit_date": "2026-02-13",
        "visit_order": 2,
        "customer_name": "Beleaf",
        "visit_report": "Follow up project healthy chips. Untuk item yang sudah final ada 2 di rasa sambal matah dan mie goreng, dan yang sambal matah ini akan didaftarkan ke BPOM terlebih dahulu. Namun, cust baru dapat info dari maklon kalau mereka hanya bisa proses allergen soy dan dairy, sehingga bahan seperti shrimp powder harus diganti dan perlu improvement. Untuk mie goreng yang dipakai untuk produk popcorn, saat ini cust belum menentukan akan maklon dengan siapa antara cornindo atau planet popcorn, dan dari maklon akan trial dulu sehingga ada permintaan sampel untuk trial di maklon. Untuk saat ini seasoning yang sudah final baru mie goreng saja karena yang untuk chips ada peraturan alergen baru.",
        "sample_no": []
    },
    {
        "visit_date": "2026-02-16",
        "visit_order": 1,
        "customer_name": "Heinz",
        "visit_report": "Mengantar dokumen kontrak onion powder ke customer. Namun dokumen masih ada yang kurang, info terbaru dari customer memerlukan 2 copy dan materai sehingga perlu dilengkapi lagi. Terkait permintaan dokumen halal olam, saat ini belum ada info baru lagi.",
        "sample_no": []
    },
    {
        "visit_date": "2026-02-16",
        "visit_order": 2,
        "customer_name": "Yorkindo",
        "visit_report": "Update penjualan yorkindo. Untuk stok lama saat ini sudah hampir habis, dan yang stok lama ini tidak perlu extend shelf life lagi. Untuk terbaru, estimasi customer belum habis pada tanggal best before, tetapi untuk yang baru ini rencananya yorkindo akan mengajukan extend shelf life supaya dokumentasi lebih proper dan tidak seperti order sebelumnya.",
        "sample_no": []
    }
]